# DS Capstone DBMS Project
## By A. Student

#

# Table of Contents
### 1. List of Functional Requirements
### 2. Data Generator
### 3. Data Definition Language (DDL)
### 4. Data Manipulation Language (DML)
### 5. Application Code

# List of Functional Requirements
## This section is a list of system requirements used to structure the data and the DDL

### One or many employees can work for one department
### An employee can have one employee performance score
### An employee can have one system password
### An employee can have one, many, or no dependents
### An employee can have one manager and a manager can have one or many employees
### A manager can have one department
### A manager can have one system password
### A mangager can have one performance score
### A manager can have one, many, or no dependents

# Data Generator
### This section contains the code to create 500 rows of employee data and 50 rows of manager data that can be joined using a shared "manager_id" feature.

## Imports

In [1]:
# Import relevant packages and instantiate the faker module

import numpy as np
import pandas as pd
from faker import Faker
from faker.providers import internet
import random
fake = Faker()

ModuleNotFoundError: No module named 'faker'

## Create Employee Dataframe

In [ ]:
# Make class to generate some random features for employee data.

def create_employee_personal_df(num = 1):
    employee_data = [{'employee_name':fake.unique.name(),
             'employee_age':random.randint(21, 60),
             'employee_address':fake.unique.address(),
         'employee_phone_number':fake.unique.phone_number(),
            'employee_performance_score':random.randint(1, 10),
            'employee_system_password': random.randint(10000000, 99999999),
            'employee_dependent': fake.unique.name()
            }
            for x in range(num)]
    return pd.DataFrame(employee_data)

In [ ]:
# Instantiate employee dataframe with 500 rows.

employee_df = create_employee_personal_df(500)

In [ ]:
# Add empty columns to employee_df to add more features.

employee_df['employee_job_title'] = ""
employee_df['employee_department'] = ""
employee_df['employee_salary_usd'] = ""

In [ ]:
# Many warning are brought up when adding values to the columns created, ignore wanrnings.

import warnings
warnings.filterwarnings('ignore')

# Insert data to columns via index so that rows of related features will be alligned. For example, sales_person
# in the job title column must only be found with sales in the department column.

employee_df.employee_job_title[0:100] = 'sales_person'
employee_df.employee_department[0:100] = 'sales'
employee_df.employee_salary_usd[0:100] = '70,000'

employee_df.employee_job_title[100:175] = 'business_analyst'
employee_df.employee_department[100:175] = 'business'
employee_df.employee_salary_usd[100:175] = '60,000'

employee_df.employee_job_title[175:225] = 'project_manager'
employee_df.employee_department[175:225] = 'business'
employee_df.employee_salary_usd[175:225] = '80,000'

employee_df.employee_job_title[225:300] = 'accountant'
employee_df.employee_department[225:300] = 'finance'
employee_df.employee_salary_usd[225:300] = '75,000'

employee_df.employee_job_title[300:325] = 'compliance_officer'
employee_df.employee_department[300:325] = 'human_resources'
employee_df.employee_salary_usd[300:325] = '75,000'

employee_df.employee_job_title[325:400] = 'coordinator'
employee_df.employee_department[325:400] = 'human_resources'
employee_df.employee_salary_usd[325:400] = '55,000'

employee_df.employee_job_title[400:475] = 'engineer'
employee_df.employee_department[400:475] = 'research and development'
employee_df.employee_salary_usd[400:475] = '80,000'

employee_df.employee_job_title[475:500] = 'data scientist'
employee_df.employee_department[475:500] = 'research and development'
employee_df.employee_salary_usd[475:500] = '100,000'

In [ ]:
# Add new features to the employee data.

employee_df['employee_performance_score_id'] =  (range(1100,1600))
employee_df['employee_email'] = employee_df.employee_name.str.replace('\s+', '.') + '@business.com'
employee_df['employee_id'] = (range(1100,1600))
employee_df['manager_id'] = manager_id = pd.DataFrame(np.repeat(range(1200, 1250), 10))

In [ ]:
# Create employee dependent feature for employees with id bewtween 1100 and 1200.

employee_dependent_id = []
for i in range(1100, 1200):
    employee_dependent_id.append(i)
    
employee_dependent_id = employee_dependent_id * 5

employee_df['employee_dependent_id'] = employee_dependent_id

In [ ]:
# Take the commas out of this df so that it can be read into postgreSQL.

employee_df = employee_df.replace(',','', regex=True)

## Create Manager Dataframe

In [ ]:
# Make class to generate some random features for manager data.

def create_manager_data(num = 1):
    manager_data = [{'manager_name':fake.unique.name(), # find a way to make only 50 managers so there will be 50 managers for the 500 employees
             'manager_age':random.randint(18, 60),
             'manager_adress':fake.unique.address(),
             'manager_phone_number':fake.unique.phone_number(),
             'manager_performance_score':random.randint(1, 10),
                'manager_system_password': random.randint(10000000, 99999999),
                'manager_dependent': fake.unique.name()
            }
            for x in range(num)]
    return pd.DataFrame(manager_data)

In [ ]:
# Create manager data for 50 rows.

manager_df = create_manager_data(50)

In [ ]:
# Add new features to the manager data.

manager_df['manager_email'] = manager_df.manager_name.str.replace('\s+', '.') + '@business.com'
manager_df['manager_id'] = range(1200, 1250)
manager_df['manager_performance_score_id'] =  range(1200, 1250)
manager_df['manager_salary_usd'] = "125,000"
manager_df['manager_department'] = ""

In [ ]:
# Insert data to columns via index so that rows of related features will be alligned.

manager_df.manager_department[0:10] = 'sales'
manager_df.manager_department[10:20] = 'business'
manager_df.manager_department[20:30] = 'finance'
manager_df.manager_department[30:40] = 'human resources'
manager_df.manager_department[40:50] = 'research and development'

In [ ]:
# Create manager dependent feature for employees with id bewtween 1200 and 1225.

manager_dependent_id = []
for i in range(1200, 1225):
    manager_dependent_id.append(i)
    
manager_dependent_id = manager_dependent_id * 2

manager_df['manager_dependent_id'] = manager_dependent_id

In [ ]:
# Take the commas out of this df so that it can be read into postgreSQL.

manager_df = manager_df.replace(',','', regex=True)

## Write to CSV

In [ ]:
# Write the dataframes to a csv to be uploaded to PostgreSQL.

employee_df.to_csv('employee_df.csv')
manager_df.to_csv('manager_df.csv')

# Data Definition Language (DDL)
## This section contains the DDL for the database. Drop statements are included in the beginning if you wish to later drop the tables. Components of the DDL include:
### 10 tables
### Two view definitions and an explanation of how to use these views/who would use them
### Two general SQL functions
### One trigger function
### One stored procedure

In [ ]:
/* Drop all components of database (do not run this portion for initial set-up of database) */

DROP FUNCTION managed_employees;
DROP FUNCTION employee_job_title;
DROP TRIGGER checksalary ON employee_business;
DROP FUNCTION check_salary();

DROP VIEW managed_employees;
DROP VIEW it_services_employee;
DROP VIEW it_services_manager;

DROP TABLE employee_business CASCADE;
DROP TABLE employee_passwords;
DROP TABLE employee_performance_score;
DROP TABLE employee_personal;
DROP TABLE manager_business CASCADE;
DROP TABLE manager_passwords;
DROP TABLE manager_performance_score;
DROP TABLE manager_personal;
DROP TABLE employee_dependents;
DROP TABLE manager_dependents;

In [ ]:
                                                                    /* Import the emplolyee data from CSV */

CREATE TABLE employee
(
" " int,
employee_name char(50),
employee_age int,
employee_address varchar(100),
employee_phone_number varchar(50),
employee_performance_score int,
employee_system_password varchar(50),
employee_dependent varchar(50),
job_title varchar(50),
department varchar(50),
salary_usd int,
employee_performance_score_id varchar(50),
employee_email varchar(50),
employee_id varchar(50),
manager_id varchar(50),
employee_dependent_id varchar(50)
);


COPY employee FROM '//Users/<AStudent>/Public/employee_df.csv' with CSV HEADER;


                                                            /* Import the manager data from CSV */

CREATE TABLE manager
(
" " varchar(500),
manager_name char(50),
manager_age int,
manager_address varchar(100),
manager_phone_number varchar(50),
manager_performance_score int,
manager_system_password varchar(50),
manager_dependent varchar(50),
manager_email varchar(50),
manager_id varchar(50),
manager_performance_score_id int,
salary_usd int,
department varchar(50),
manager_dependent_id varchar(50)
);


COPY manager FROM '//Users/<AStudent>/Public/manager_df.csv' with CSV HEADER;


                                                            /* Create Table Statements */

/* Create employee_personal table and insert columns from the import table */

CREATE TABLE employee_personal
(
employee_name char(50) NOT NULL UNIQUE,
employee_age int NOT NULL,
employee_address varchar(100) NOT NULL,
employee_phone_number varchar(50) NOT NULL UNIQUE,
employee_id varchar(50) NOT NULL UNIQUE);


INSERT INTO employee_personal
SELECT
employee_name,
employee_age,
employee_address,
employee_phone_number,
employee_id
FROM employee;

/* Create employee_business table and insert columns from the import table */


CREATE TABLE employee_business
(
job_title varchar(50),
department varchar(50),
salary_usd int,
employee_id varchar(50) NOT NULL UNIQUE,
employee_email varchar(50) NOT NULL UNIQUE,
manager_id varchar(50));

INSERT INTO employee_business
SELECT
job_title,
department,
salary_usd,
employee_id,
employee_email,
manager_id
FROM employee;

/* Create employee_performance_score table and insert columns from the import table */

CREATE TABLE employee_performance_score
(
employee_performance_score int NOT NULL,
employee_performance_score_id varchar(50) NOT NULL UNIQUE);

INSERT INTO employee_performance_score
SELECT
employee_performance_score,
employee_performance_score_id
FROM employee;

/* Create employee_passwords table and insert columns from the import table */

CREATE TABLE employee_passwords
(
employee_system_password varchar(50) NOT NULL UNIQUE,
employee_email varchar(50) NOT NULL UNIQUE);

INSERT INTO employee_passwords
SELECT
employee_system_password,
employee_email
FROM employee;


/* Create employee_dependents table from the import table */

CREATE TABLE employee_dependents
(
employee_dependent varchar(50) NOT NULL,
employee_dependent_id varchar(50) NOT NULL);

INSERT INTO employee_dependents
SELECT
employee_dependent,
employee_dependent_id
FROM employee;


/* Create manager_personal table and insert columns from the import table */

CREATE TABLE manager_personal
(
manager_name char(50) NOT NULL UNIQUE,
manager_age int NOT NULL,
manager_address varchar(100) NOT NULL,
manager_phone_number varchar(50) NOT NULL UNIQUE,
manager_id varchar(50) NOT NULL UNIQUE);


INSERT INTO manager_personal
SELECT
manager_name,
manager_age,
manager_address,
manager_phone_number,
manager_id
FROM manager;

/* Create manager_business table and insert columns from the import table */


CREATE TABLE manager_business
(
department varchar(50),
manager_id varchar(50) NOT NULL UNIQUE,
salary_usd int,
manager_email varchar(50) NOT NULL UNIQUE);


INSERT INTO manager_business
SELECT
department,
manager_id,
salary_usd,
manager_email
FROM manager;

/* Create manager_performance_score table and insert columns from the import table */


CREATE TABLE manager_performance_score
(
manager_performance_score int  NOT NULL,
manager_performance_score_id varchar(50) NOT NULL UNIQUE);


INSERT INTO manager_performance_score
SELECT
manager_performance_score,
manager_performance_score_id
FROM manager;

/* Create manager_passwords table and insert columns from the import table */

CREATE TABLE manager_passwords
(
manager_system_password varchar(50) NOT NULL UNIQUE,
manager_email varchar(50) NOT NULL UNIQUE);


INSERT INTO manager_passwords
SELECT
manager_system_password,
manager_email
FROM manager;


/* Create manager_dependents table from the import table */

CREATE TABLE manager_dependents
(
manager_dependent varchar(50) NOT NULL,
manager_dependent_id varchar(50) NOT NULL);

INSERT INTO manager_dependents
SELECT
manager_dependent,
manager_dependent_id
FROM manager;



/* Drop the original tables used for initial import */

DROP TABLE employee;
DROP TABLE manager;


                                                                        /* Table Constraints */



ALTER TABLE employee_personal 
ADD CONSTRAINT PK_employee_id_personal PRIMARY KEY (employee_id);

ALTER TABLE manager_personal 
ADD CONSTRAINT PK_manager_id_personal PRIMARY KEY (manager_id);

ALTER TABLE employee_business 
ADD CONSTRAINT PK_employee_id_business PRIMARY KEY (employee_id);

ALTER TABLE manager_business
ADD CONSTRAINT PK_manager_id_business PRIMARY KEY (manager_id);

ALTER TABLE employee_dependents 
ADD CONSTRAINT FK_employee_dependent_id FOREIGN KEY (employee_dependent_id) REFERENCES employee_business (employee_id);

ALTER TABLE manager_dependents 
ADD CONSTRAINT FK_manager_dependent_id FOREIGN KEY (manager_dependent_id) REFERENCES manager_business (manager_id);

ALTER TABLE manager_performance_score
ADD CONSTRAINT FK_manager_performance_score_id FOREIGN KEY (manager_performance_score_id) REFERENCES manager_business (manager_id);

ALTER TABLE employee_performance_score
ADD CONSTRAINT FK_employee_performance_score_id FOREIGN KEY (employee_performance_score_id) REFERENCES employee_business (employee_id);

ALTER TABLE employee_passwords
ADD CONSTRAINT FK_employee_email FOREIGN KEY (employee_email) REFERENCES employee_business (employee_email);

ALTER TABLE manager_passwords
ADD CONSTRAINT FK_manager_email FOREIGN KEY (manager_email) REFERENCES manager_business (manager_email);


                                                                       /* Function #1 */

/* Function that returns all employee names being managed by a given manager. Takes manager_id as input. */


CREATE OR REPLACE FUNCTION managed_employees (manager_name CHAR(50))
RETURNS TABLE (employee_namee CHAR(50))
LANGUAGE plpgsql
AS
$$
    BEGIN
	RETURN QUERY
    SELECT employee_name
    FROM employee_personal INNER JOIN employee_business ON employee_personal.employee_id = employee_business.employee_id
    WHERE employee_personal.employee_id IN (SELECT employee_id
        FROM manager_personal INNER JOIN employee_business ON
		manager_personal.manager_id = employee_business.manager_id
        WHERE manager_personal.manager_id = managed_employees.manager_name);
    END;
$$;



                                                                       /* Function #2 */

/* Function that returns all employees with a given job title. Takes job title as input. */


CREATE OR REPLACE FUNCTION employee_job_title (job_title VARCHAR(50))
RETURNS TABLE (employee_namee CHAR(50),
                job_titlee VARCHAR(50))
LANGUAGE plpgsql
AS
$$
    BEGIN
	RETURN QUERY
       SELECT employee_name, employee_business.job_title
        FROM employee_personal INNER JOIN employee_business ON
		employee_personal.employee_id = employee_business.employee_id WHERE
        employee_business.job_title = employee_job_title.job_title;
    END;
$$;



                                                                        /* Trigger */

/* Trigger - Trigger that raises an exception when a number less than or equal to 0 is entered for employee_business salary.
 This will prevent invalid salary values from being added to the DBMS. */    


CREATE FUNCTION check_salary() RETURNS trigger
LANGUAGE plpgsql
AS $$
BEGIN
    IF NEW.salary_usd <= 0 THEN
    RAISE EXCEPTION 'salary is not a valid positive number';
    END IF;
    RETURN NEW;
END;
$$;

CREATE TRIGGER checksalary
    BEFORE INSERT on employee_business
    FOR EACH ROW
    WHEN (NEW.salary_usd <= 0)
    EXECUTE PROCEDURE check_salary();
    

                                                                    /* Stored Procedure */
                                                                    
/* Stored Procedure - that adjusts all salaries in the DBMS for inflation (3% increase to all salaries) */



CREATE or REPLACE PROCEDURE adjust_inflation()
LANGUAGE PLPGSQL    
as $$
BEGIN
    UPDATE employee_business
    SET salary_usd = salary_usd * 1.03;
    UPDATE manager_business
    SET salary_usd = salary_usd * 1.03;
END;
$$;

                                                                        /* VIEW #1 */

/* This view is for managers to see a list of all employees that they could be managing, but does not show data that would be private to the employee
or irrelevant to the manager. */

 
CREATE VIEW managed_employees AS
  SELECT
  employee_name,
  employee_personal.employee_id,
  employee_email,
  department,
  job_title,
  manager_id
  FROM employee_personal, employee_business;
  
  
                                                                     /* VIEW #2 AND #3 */

/* The following are two views for IT services. The first view contains passwords, email addresses, IDs, and names for all of the employees. The second view contains 
passwords, email addresses, IDs, and names, for all of the managers. This would restrict IT to only access information relevant to their responsibilities and
restrict access to personal or unrelated information */

CREATE VIEW it_services_employee AS
(SELECT employee_system_password, employee_business.employee_email,
        employee_business.employee_id, employee_personal.employee_name, employee_business.manager_id
        FROM employee_passwords
        INNER JOIN employee_business
        ON employee_business.employee_email = employee_passwords.employee_email
        INNER JOIN employee_personal
        ON employee_business.employee_id = employee_personal.employee_id);
        
CREATE VIEW it_services_manager AS
  (SELECT manager_system_password, manager_business.manager_email,
        manager_business.manager_id, manager_personal.manager_name
        FROM manager_passwords
        INNER JOIN manager_business
        ON manager_business.manager_email = manager_passwords.manager_email
        INNER JOIN manager_personal
        ON manager_business.manager_id = manager_personal.manager_id);

# Data Manipulation Language (DML)
## This section contains the DML. For each table (ten total) there will be at least:
### Five example insert statements
### One example of a delete statement
### One example of an update statement
### One example of a SQL query that use the previous DML statements
## This also has one example of a more complex query using subqueries and joins

In [3]:
                                                                /* Table #1 - employee_personal */

-/* INSERT rows of data to the employee_personal table, use a delete statement, and use an update */

INSERT INTO employee_personal (employee_name, employee_age, employee_address, employee_phone_number, employee_id)
VALUES ('Eric Ly', 24, '123 Wayne Rd. Wayne PA 19087', '123-456-7890', '1600');

INSERT INTO employee_personal (employee_name, employee_age, employee_address, employee_phone_number, employee_id)
VALUES ('Gerald Jones', 31, '1002 Devon Rd. Devon PA 19333', '124-456-7890', '1601');

INSERT INTO employee_personal (employee_name, employee_age, employee_address, employee_phone_number, employee_id)
VALUES ('Tasha Smith', 43, '1112 Norristown Rd. Norristown PA 19401', '125-456-7890', '1602');

INSERT INTO employee_personal (employee_name, employee_age, employee_address, employee_phone_number, employee_id)
VALUES ('Bill Smith', 26, '123 Harleysville Rd. Harleysville PA 19438', '126-456-7890', '1603');

INSERT INTO employee_personal (employee_name, employee_age, employee_address, employee_phone_number, employee_id)
VALUES ('Josephine Joe', 31, '1002 Ambler Rd. Ambler PA 19002', '127-456-7890', '1604');

DELETE FROM employee_personal
WHERE employee_name = 'Eric Ly';

SELECT employee_id
FROM employee_personal
WHERE employee_name = 'Gerald Jones';

UPDATE employee_personal SET employee_name = 'Gerard Jonas' WHERE employee_name = 'Gerald Jones';


                                                      /* Table #2 - manager_personal */

/* INSERT rows or partial rows of data to the manager_personal table, use a delete statement, and use an update */

INSERT INTO manager_personal (manager_name, manager_age, manager_address, manager_phone_number, manager_id)
VALUES ('Olivia Ly', 22, '333 Forrest Rd. Phoenixville PA 18360', '321-454-7890', '1250');

INSERT INTO manager_personal (manager_name, manager_age, manager_address, manager_phone_number, manager_id)
VALUES ('Kiet Ly', 52, '333 Forrest Rd. Phoenixville PA 18360', '321-674-7890', '1251');

INSERT INTO manager_personal (manager_name, manager_age, manager_address, manager_phone_number, manager_id)
VALUES ('Tammy Ly', 51, '333 Forrest Rd. Phoenixville PA 18360', '321-712-7990', '1252');

INSERT INTO manager_personal (manager_name, manager_age, manager_address, manager_phone_number, manager_id)
VALUES ('Dominic Smith', 30, '123 ColdBrew Rd. Coffee PA 19781', '541-982-7800', '1253');

INSERT INTO manager_personal (manager_name, manager_age, manager_address, manager_phone_number, manager_id)
VALUES ('John Smith', 35, '891 Coffee Rd. Tea PA 19651', '321-826-0956', '1254');

DELETE FROM manager_personal
WHERE manager_name = 'John Smith';

SELECT manager_id
FROM manager_personal
WHERE manager_name = 'Olivia Ly';

UPDATE manager_personal SET manager_name = 'Gerard Jonas' WHERE manager_name = 'Gerald Jones';


                                                    /* Table #3 - emplopyee_business */

/* INSERT rows or partial rows of data to the employee_business table, use a delete statement, and use an update */

INSERT INTO employee_business (department, job_title, salary_usd, employee_id, employee_email, manager_id)
VALUES ('finance', 'accountant', 70000, '1601', 'personone@business.com', '1255');

INSERT INTO employee_business (department, job_title, salary_usd, employee_id, employee_email, manager_id)
VALUES ('business', 'project manager', 80000, '1602', 'persontwo@business.com', '1256');

INSERT INTO employee_business (department, salary_usd, employee_id, employee_email, manager_id)
VALUES ('business', 80000, '1603', 'personthree@business.com', '1257');

INSERT INTO employee_business (department, salary_usd, employee_id, employee_email, manager_id)
VALUES ('human_resources', 80000, '1604', 'personfour@business.com', '1258');

INSERT INTO employee_business (department, job_title, salary_usd, employee_id, employee_email, manager_id)
VALUES ('human_resources', 'compliance_office', 75000, '1605', 'personfive@business.com', '1259');

INSERT INTO employee_business (department, job_title, salary_usd, employee_id, employee_email, manager_id)
VALUES ('human_resources', 'compliance_office', 75000, '1606', 'personsix@business.com', '1259');

DELETE FROM employee_business
WHERE employee_id  = '1602';

SELECT job_title
FROM employee_business
WHERE employee_id = '1255';

UPDATE employee_business SET job_title = 'New Job' WHERE job_title = 'Data Scientist';


                                                     /* Table #4 - manager_business */

/* INSERT rows or partial rows of data to the manager_business table, use a delete statement, and use an update */

INSERT INTO manager_business (department, manager_id, salary_usd, manager_email)
VALUES ('finance', '1260', 125000, 'humanone@business.com');

INSERT INTO manager_business (department, manager_id, salary_usd, manager_email)
VALUES ('business', '1261', 125000, 'humantwo@business.com');

INSERT INTO manager_business (department, manager_id, salary_usd, manager_email)
VALUES ('finance', '1262', 125000, 'humanthree@business.com');

INSERT INTO manager_business (department, manager_id, salary_usd, manager_email)
VALUES ('research and development', '1263', 125000, 'humanfour@business.com');

INSERT INTO manager_business (department, manager_id, salary_usd, manager_email)
VALUES ('sales', '1264', 125000, 'humanfive@business.com');

INSERT INTO manager_business (department, manager_id, salary_usd, manager_email)
VALUES ('sales', '1265', 125000, 'humansix@business.com');

INSERT INTO manager_business (department, manager_id, salary_usd, manager_email)
VALUES ('finance', '1266', 125000, 'humanseven@business.com');

DELETE FROM manager_business
WHERE manager_id  = '1262';

SELECT department
FROM manager_business
WHERE manager_id = '1264';

UPDATE manager_business SET department = 'finance' WHERE department = 'finance';


                                                  /* Table #5 - employee_performance_score */

/* INSERT rows or partial rows of data to the employee_performance_score table, use a delete statement, and use an update */

INSERT INTO employee_performance_score (employee_performance_score, employee_performance_score_id)
VALUES (7, '1601');

INSERT INTO employee_performance_score (employee_performance_score, employee_performance_score_id)
VALUES (3, '1606');

INSERT INTO employee_performance_score (employee_performance_score, employee_performance_score_id)
VALUES (4, '1603');

INSERT INTO employee_performance_score (employee_performance_score, employee_performance_score_id)
VALUES (9, '1604');

INSERT INTO employee_performance_score (employee_performance_score, employee_performance_score_id)
VALUES (2, '1605');

DELETE FROM employee_performance_score
WHERE employee_performance_score  = '1606';

SELECT employee_performance_score
FROM employee_performance_score
WHERE employee_performance_score_id = '1605';

UPDATE employee_performance_score SET employee_performance_score = 9 WHERE employee_performance_score_id = '1605';


                                                 /* Table #6 - manager_performance_score */

/* INSERT rows or partial rows of data to the manager_performance_score table, use a delete statement, and use an update */

INSERT INTO manager_performance_score (manager_performance_score, manager_performance_score_id)
VALUES (5, '1260');

INSERT INTO manager_performance_score (manager_performance_score, manager_performance_score_id)
VALUES (7, '1261');

INSERT INTO manager_performance_score (manager_performance_score, manager_performance_score_id)
VALUES (3, '1263');

INSERT INTO manager_performance_score (manager_performance_score, manager_performance_score_id)
VALUES (2, '1264');

INSERT INTO manager_performance_score (manager_performance_score, manager_performance_score_id)
VALUES (9, '1265');

DELETE FROM manager_performance_score
WHERE manager_performance_score  = '1263';

SELECT manager_performance_score
FROM manager_performance_score
WHERE manager_performance_score_id = '1264';

UPDATE manager_performance_score SET manager_performance_score = 9 WHERE manager_performance_score_id = '6054';


                                                        /* Table #7 - employee_passwords */

/* INSERT rows or partial rows of data to the employee_passwords table, use a delete statement, and use an update */

INSERT INTO employee_passwords (employee_system_password, employee_email)
VALUES (10000001, 'personone@business.com');

INSERT INTO employee_passwords (employee_system_password, employee_email)
VALUES (10007657, 'personthree@business.com');

INSERT INTO employee_passwords (employee_system_password, employee_email)
VALUES (10208627, 'personfour@business.com');

INSERT INTO employee_passwords (employee_system_password, employee_email)
VALUES (10044457, 'personfive@business.com');

INSERT INTO employee_passwords (employee_system_password, employee_email)
VALUES (12007687, 'personsix@business.com');

DELETE FROM employee_passwords
WHERE employee_email  = 'personsix@business.com';

SELECT employee_system_password
FROM employee_passwords
WHERE employee_email = 'personfive@business.com';

UPDATE employee_passwords SET employee_system_password = 12007687 WHERE employee_email = 'johnsmith@eastern.edu';


                                                        /* Table #8 - manager_passwords */

/* INSERT rows or partial rows of data to the manager_password table, use a delete statement, and use an update */

INSERT INTO manager_passwords (manager_system_password, manager_email)
VALUES (100450001, 'humanone@business.com');

INSERT INTO manager_passwords (manager_system_password, manager_email)
VALUES (10008989, 'humantwo@business.com');

INSERT INTO manager_passwords (manager_system_password, manager_email)
VALUES (10232127, 'humanfour@business.com');

INSERT INTO manager_passwords (manager_system_password, manager_email)
VALUES (10098457, 'humanfive@business.com');

INSERT INTO manager_passwords (manager_system_password, manager_email)
VALUES (13207687, 'humansix@business.com');

DELETE FROM manager_passwords
WHERE manager_email  = 'humanfive@business.com';

SELECT manager_system_password
FROM manager_passwords
WHERE manager_email = 'humanfour@business.com';

UPDATE manager_passwords SET manager_system_password = '10232127' WHERE manager_email = 'humanfour@business.com';


                                                       /* Table #9 - employee_dependents */

/* INSERT rows or partial rows of data to the employee_dependents table, use a delete statement, and use an update statement */


INSERT INTO employee_dependents (employee_dependent, employee_dependent_id)
VALUES ('Aron Schiller', 1601);

INSERT INTO employee_dependents (employee_dependent, employee_dependent_id)
VALUES ('Olivia Ly', 1603);

INSERT INTO employee_dependents (employee_dependent, employee_dependent_id)
VALUES ('Eric Ly', 1604);

INSERT INTO employee_dependents (employee_dependent, employee_dependent_id)
VALUES ('James Jack', 1605);

INSERT INTO employee_dependents (employee_dependent, employee_dependent_id)
VALUES ('Robert George', 1606);

DELETE FROM employee_dependents
WHERE employee_dependent  = 'Robert George';

SELECT employee_dependent
FROM employee_dependents
WHERE employee_dependent = '1604';

UPDATE employee_dependents SET employee_dependent_id = '1601' WHERE employee_dependent = 'Jack James';


                                                  /* Table 10 - manager_dependents */

/* INSERT rows or partial rows of data to the manager_dependents table, use a delete statement, and use an update */


INSERT INTO manager_dependents (manager_dependent, manager_dependent_id)
VALUES ('Olivia Ly', 1260);

INSERT INTO manager_dependents (manager_dependent, manager_dependent_id)
VALUES ('Aron Schiller', 1261);

INSERT INTO manager_dependents (manager_dependent, manager_dependent_id)
VALUES ('James Jack',1263);

INSERT INTO manager_dependents (manager_dependent, manager_dependent_id)
VALUES ('Robert George', 1264);

INSERT INTO manager_dependents (manager_dependent, manager_dependent_id)
VALUES ('Eric Ly', 1265);

DELETE FROM manager_dependents
WHERE manager_dependent  = 'Eric Ly';

SELECT manager_dependent
FROM manager_dependents
WHERE manager_dependent_id = '1264';

UPDATE manager_dependents SET manager_dependent_id = '1264' WHERE manager_dependent = 'James Jack';



                                                /* Complex Query Example */

/* SELECT statement that finds all passwords, emails, id, and names for all employees and managers. This could be used by IT services
    to search through and analyze all passwords to meet new criteria. Then, IT could reach out to the appropriate managers or employes
    to change their passwords. */

    SELECT * FROM

        (SELECT employee_system_password, employee_business.employee_email,
        employee_business.employee_id, employee_personal.employee_name, employee_business.manager_id
        FROM employee_passwords
        INNER JOIN employee_business
        ON employee_business.employee_email = employee_passwords.employee_email
        INNER JOIN employee_personal
        ON employee_business.employee_id = employee_personal.employee_id) as e_query

    INNER JOIN

           (SELECT manager_system_password, manager_business.manager_email,
        manager_business.manager_id, manager_personal.manager_name
        FROM manager_passwords
        INNER JOIN manager_business
        ON manager_business.manager_email = manager_passwords.manager_email
        INNER JOIN manager_personal
        ON manager_business.manager_id = manager_personal.manager_id) as m_query

    ON e_query.manager_id = m_query.manager_id;

SyntaxError: invalid syntax (2815331461.py, line 3)

# Application Code
## This section interacts with a postgreSQL database in 3 ways:
### 1. Performing a SQL query and printing the result
### 2. Performing an insert function and printing the result
### 3. Calling a stored procedure and printing the changes to the database

# Import

In [ ]:
# Import psycopg2 to enable connection to postgreSQL.

import psycopg2

# Search Function with User Input

In [ ]:
# Function that searches employee id when provided an employee name from the employee_name table.

def search_employees():
    name = input("Enter an employee name then press enter:")
    connection = psycopg2.connect(host = "localhost", database = "postgres", user = "postgres", password = "A.Password")
    cursor = connection.cursor()
    cursor.execute(f"SELECT employee_id FROM employee_personal WHERE employee_name = '{name}'")
    rows = cursor.fetchall()
    print()
    print(f"{name}'s employee_id: {rows}")
    cursor.close()
    connection.close()

In [ ]:
# Query to find a name to use in the new search employees function.

connection = psycopg2.connect(host = "localhost", database = "postgres", user = "postgres", password = "Mint172!")
cursor = connection.cursor()
cursor.execute(f"SELECT employee_name FROM employee_personal WHERE employee_id = '1100'")
query_1 = cursor.fetchall()
print(query_1)
cursor.close()
connection.close()

In [ ]:
# For example, enter the name generated in the above query.

search_employees()

# Insert Function

In [ ]:
# Function that adds department, salary, and employee_id values to the employee_business table.

def insert_employee_business(department, job_title, salary_usd, employee_id, employee_email, manager_id):
    connection = psycopg2.connect(host = "localhost", database = "postgres", user = "postgres", password = "A.Password")
    cursor = connection.cursor()
    insert_command = f"INSERT INTO employee_business (department, job_title, salary_usd, employee_id, employee_email, manager_id) VALUES ('{department}', '{job_title}', {salary_usd}, '{employee_id}', '{employee_email}', '{manager_id}');"
    cursor.execute(insert_command)
    connection.commit()
    cursor.close()
    connection.close()

In [ ]:
# Example of the insert function.

insert_employee_business('new department', 'new job', 170000, '2000', 'newemail@business.com', '3000')

In [ ]:
# Query to check that the insert function works properly.

connection = psycopg2.connect(host = "localhost", database = "postgres", user = "postgres", password = "A.Password")
cursor = connection.cursor()
cursor.execute(f"SELECT * FROM employee_business WHERE employee_id = '2000';")
query_2 = cursor.fetchall()
print(query_2)
cursor.close()
connection.close()

# Calling a Stored Procedure

In [ ]:
# This will print an EMPLOYEE salary from the database BEFORE we call the stored procedure so we can see that the stored procedure increased salary by 3%.

connection = psycopg2.connect(host = "localhost", database = "postgres", user = "postgres", password = "A.Password")
cursor = connection.cursor()
cursor.execute(f"SELECT salary_usd FROM employee_business WHERE employee_id = '1550';")
query = cursor.fetchall()
print('employee_salary_usd BEFORE inflation: ', query[0])
cursor.close()
connection.close()

In [ ]:
# This will print a MANAGER salary from the database BEFORE we call the stored procedure so we can see that the stored procedure increased salary by 3%.

connection = psycopg2.connect(host = "localhost", database = "postgres", user = "postgres", password = "A.Password")
cursor = connection.cursor()
cursor.execute(f"SELECT salary_usd FROM manager_business WHERE manager_id = '1230';")
query = cursor.fetchall()
print('manager_salary_usd BEFORE inflation: ', query[0])
cursor.close()
connection.close()

In [ ]:
# Code that accesses a stored procedure from postgresql which increases all salaries (both employee and manager salaries) by 3%.

connection = psycopg2.connect(host = "localhost", database = "postgres", user = "postgres", password = "A.Password")
cursor = connection.cursor()
procedure_command = f"CALL adjust_inflation()"
cursor.execute(procedure_command)
connection.commit()
cursor.close()

In [ ]:
# This will print an EMPLOYEE salary from the database AFTER we call the stored procedure so we can see that the stored procedure increased salary by 3%.

connection = psycopg2.connect(host = "localhost", database = "postgres", user = "postgres", password = "A.Password")
cursor = connection.cursor()
cursor.execute(f"SELECT salary_usd FROM employee_business WHERE employee_id = '1550';")
query = cursor.fetchall()
print('employee_salary_usd AFTER inflation: ', query[0])
cursor.close()
connection.close()

In [ ]:
# This will print a MANAGER salary from the database AFTER we call the stored procedure so we can see that the stored procedure increased salary by 3%.

connection = psycopg2.connect(host = "localhost", database = "postgres", user = "postgres", password = "A.Password")
cursor = connection.cursor()
cursor.execute(f"SELECT salary_usd FROM manager_business WHERE manager_id = '1230';")
query = cursor.fetchall()
print('manager_salary_usd AFTER inflation: ', query[0])
cursor.close()
connection.close()